//
// WirelessAudioUpdate.c
//

#include "project.h"
#include "WirelessAudioUpdate.h"
#include "WirelessAudioI2C.h"
#include "WirelessAudioUtilities.h"
#include "WirelessAudioISR.h"
#include "darr_prog_new_qual_03.01.25_8437.h"

#include "UITask.h"
#include "UpdateManagerBlob.h"
#include "BufferManager.h"
#include "etap.h"
#include "UpdateVariant.h"

#if defined(MAXWELL) || defined(SKIPPER)
#include "internalFlashAPI.h"
#include "heatshrink_common.h"
#include "heatshrink_config.h"
#include "heatshrink_decoder.h"
#else
#include "nvram.h"
#endif

SCRIBE_DECL(wa_update);

#define WA_MAX_EXPAND_BUFF_SIZE 1024
#define MAX_EXPANSION_FLASH_BUFF 0x8000   
#define BL_IMAGE_HEADER_OFFSET 0
#define MU_IMAGE_HEADER_OFFSET 0x3000
#define CU_IMAGE_HEADER_OFFSET 0x10000
#define WA_MAX_TX_ARRAY 256
#define MAX_TX_SIZE 32 /* Use this to make the traces look like each other */
#define FINALBLOCK_UNCOMPRESSED_DATA_GROUPING_EQUALIZER 40 /* FUDGE */

#if defined(MAXWELL) || defined(SKIPPER)
#define PAGE_SIZE                0x8000
#define BASE_EXPANSION_FLASH     0x08008000
#endif

typedef __packed struct header0
{
    char  marker[4];            // Marker "DARR"
    uint8_t i2cMapAddrSize;     // 0x02 I2C Map Address Size in bytes
    uint8_t i2cMSTR_IMTP_VAL  ; // 0x01 i2c master IMTP register value   |
    uint8_t i2cMSTR_IMSCLP_VAL; // 0x22 i2c master IMSCLP register value | Specify i2c speed
    uint8_t i2cMSTR_IMST;       // 0x22 i2c master IMST register value   |
    uint8_t i2cMSTR_IMDS;       // 0x21 i2c master IMDS register value   |
    uint8_t clkMCUCC1;          // 0x7f MCU clock
    uint8_t clkMCUCC2;          // 0x07 Peripheral Clock
    uint8_t rsvd0;              // 0x00 Currently not in use
    uint8_t numItemsRecTab;     // 0x0a Number of items in record table
    uint8_t rsvd1;              // 0x00 Not in use
    uint16_t checksum;          // 16bit CRC
}waUpdateHeader0_t;

typedef __packed struct header1
{
    uint8_t id_and_record_type; // bit7 in use, bit1 = data record, bit 0 = code record
    uint16_t recordSize;
    uint16_t crc;
    uint16_t eepromAddress;
    uint16_t extDataAddress;
    uint16_t firmwareExecAddress;
    uint8_t majorVersionSource;
    uint8_t minorVersionSource;
    uint8_t buildVersionSource;
    uint16_t checksum; //
} waUpdateHeader1_t;

typedef __packed struct waUpdate
{
    uint32_t muRealLength;  /* The length in the headers is incorrect, pass this to flash function */
    uint32_t cuRealLength;  /* The length in the headers is incorrect, pass this to flash function */
    waUpdateHeader1_t muH1; /* Blob creation Fill (compressed or extenal flash access problematic) */
    waUpdateHeader1_t cuH1; /* Blob creation Fill (compressed or extenal flash access problematic) */
}waUpdateInfo_t;

typedef struct 
{
